resources/transactions/tran1.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:auth="http://www.iitdgroup.ru/Intellinx/DBO/Auth" xmlns:com="http://www.iitdgroup.ru/Intellinx/DBO/Common">
    <soapenv:Header/>
    <soapenv:Body>
        <ns4:SendTransactionDataRequest xmlns="http://www.iitdgroup.ru/Intellinx/DBO/Common" xmlns:ns2="http://www.iitdgroup.ru/Intellinx/DBO/Auth" xmlns:ns3="http://www.iitdgroup.ru/Intellinx/DBO/Client" xmlns:ns4="http://www.iitdgroup.ru/Intellinx/DBO/Transaction">
            <ns4:ServerInfo>
                <Ip>localhost</Ip>
                <Port>8089</Port>
            </ns4:ServerInfo>
            <ns4:TransactionData>
                <ns4:TransactionId>99696936</ns4:TransactionId>
                <ns4:ClientIds>
                    <DboId>1433555556</DboId>
                    <CifId>1</CifId>
                    <ExpertSystemId>77831d4e66f454c1f6cfe45df096cfdc7bac368b</ExpertSystemId>
                    <LoginHash>356a192b7913b04c54574d18c28d46e6395428ab</LoginHash>
                </ns4:ClientIds>
                <ns4:DocumentSaveTimestamp>2016-10-25T12:28:56+03:00</ns4:DocumentSaveTimestamp>
                <ns4:DocumentNumber>58</ns4:DocumentNumber>
                <ns4:Cfids>1212121212</ns4:Cfids>
                <ns4:Type>CARD_TRANSFER</ns4:Type>
                <ns4:Regular>false</ns4:Regular>
                <ns4:CardTransfer>
                    <ns4:SourceCardNumber>510131******4033</ns4:SourceCardNumber>
                    <ns4:DestinationCardNumber>1000555555555555</ns4:DestinationCardNumber>
                    <ns4:AmountInSourceCurrency>200</ns4:AmountInSourceCurrency>
                    <ns4:CommissionAmount>23</ns4:CommissionAmount>
                </ns4:CardTransfer>
                <ns4:InitialSourceAmount>9590</ns4:InitialSourceAmount>
                <ns4:SessionId>385A32B4DC224B62299CAAA82E5739CF</ns4:SessionId>
                <ns4:Channel>INTERNET_CLIENT</ns4:Channel>
                <ns4:ClientDevice>
                    <ns3:Platform>IOS</ns3:Platform>
                    <ns3:IOS>
                        <ns3:IpAddress>192.168.0.1</ns3:IpAddress>
                        <ns3:IdentifierForVendor>ifv123456</ns3:IdentifierForVendor>
                        <ns3:OSVersion>6.0</ns3:OSVersion>
                    </ns3:IOS>
                </ns4:ClientDevice>
            </ns4:TransactionData>
        </ns4:SendTransactionDataRequest>
    </soapenv:Body>
</soapenv:Envelope>